app/controllers/dynamic_objects_controller.rb

  def index
    @dynamic_object = DynamicObject.all
---
SELECT "dynamic_objects".* FROM "dynamic_objects"

  def show
    @dynamic_object = DynamicObject.find(params[:id])
---
SELECT  "dynamic_objects".* FROM "dynamic_objects" WHERE "dynamic_objects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def new
    dynamic_object_type = DynamicObjectType.find(params[:dynamic_object_type_id])
---
SELECT  "dynamic_object_types".* FROM "dynamic_object_types" WHERE "dynamic_object_types"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def edit
    @dynamic_object = DynamicObject.find(params[:id])
---
SELECT  "dynamic_objects".* FROM "dynamic_objects" WHERE "dynamic_objects"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    @dynamic_object = DynamicObject.new(dynamic_object_params)
    if @dynamic_object.save
---
INSERT INTO "dynamic_objects" ("name", "location_id", "created_at", "updated_at", "dynamic_object_type_id", "properties") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    @dynamic_object = DynamicObject.find(params[:id])
    if @dynamic_object.update_attributes(dynamic_object_params)
---
SELECT  "dynamic_objects".* FROM "dynamic_objects" WHERE "dynamic_objects"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "dynamic_objects" SET "properties" = $1, "updated_at" = $2 WHERE "dynamic_objects"."id" = $3  [["properties", "--- !ruby/hash:ActiveSupport::HashWithIndifferentAccess\nauthor: Test2\npage_count: '11111'\n"], ["updated_at", 2017-05-08 18:29:25 UTC], ["id", 2]]

  def destroy
    @dynamic_object = DynamicObject.find(params[:id])
    @dynamic_object.destroy
---
SELECT  "dynamic_objects".* FROM "dynamic_objects" WHERE "dynamic_objects"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "dynamic_objects" WHERE "dynamic_objects"."id" = $1  [["id", 3]]