app/controllers/locations_controller.rb

  def index
    if params[:search].present?
      @locations = Location.near(params[:search], 50, :order => :distance)
    else
      @locations = Location.all
---
SELECT "locations".* FROM "locations"

  def create
    @location = Location.new(location_params)
    if @location.save
---
INSERT INTO "locations" ("address", "latitude", "longitude", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["address", "Minsk"], ["latitude", 53.90453979999999], ["longitude", 27.5615244], ["created_at", 2017-05-09 16:34:05 UTC], ["updated_at", 2017-05-09 16:34:05 UTC]]

  def update
    @location = Location.find(params[:id])
    if @location.update_attributes(location_params)
---
SELECT  "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "locations" SET "address" = $1, "latitude" = $2, "longitude" = $3, "updated_at" = $4 WHERE "locations"."id" = $5  [["address", "Минск, Мельникайте 4"], ["latitude", 53.906296], ["longitude", 27.5427514], ["updated_at", 2017-05-10 09:26:28 UTC], ["id", 1]]