app/views/dynamic_objects/_form.html.slim

SELECT "locations".* FROM "locations"
---
  .field
    = f.select :location_id, options_from_collection_for_select(Location.all, :id, :address)