app/views/dynamic_objects/index.html.slim

SELECT "dynamic_object_types".* FROM "dynamic_object_types"
---
    b
      = select_tag :dynamic_object_type_id, options_from_collection_for_select(DynamicObjectType.all, :id, :name)